## Prim 알고리즘 공부하기
# 1. Prim 알고리즘 이란?

# 6 11
# 0 1 32
# 0 2 31
# 0 5 60
# 0 6 51
# 1 2 21
# 2 4 46
# 2 6 25
# 3 4 34
# 3 5 18
# 4 5 40
# 4 6 51

V, E = map(int, input().split())    # V, E는 각각 노드번호와 간선 개수이다.
adjM = [[0]*(V+1) for _ in range(V+1)] # 인접행렬
for _ in range(E):
    n1, n2, w = map(int, input().split())   # 양끝 노드 n1, n2 가중치 w
    adjM[n1][n2] = w
    adjM[n2][n1] = w
print(adjM)

# [
#  [0, 32, 31, 0, 0, 60, 51],
#  [32, 0, 21, 0, 0, 0, 0],
#  [31, 21, 0, 0, 46, 0, 25],
#  [0, 0, 0, 0, 34, 18, 0],
#  [0, 0, 46, 34, 0, 40, 51],
#  [60, 0, 0, 18, 40, 0, 0],
#  [51, 0, 25, 0, 51, 0, 0]
# ]